let strA = "깨끗하게 해드리겠습니다/열등안의 전생~/허구추리/이 상처는 죽어도 지워지지 않아/오빠의 아내와~/소리를 못 내는 소녀는~/변변찮은 마술강사와~/궁정의의 딸/무정한 그녀의 독차지/구렁이에게 시집간 여자";
let strB = "졸렬☆다이나믹/쉼터에 살았다/다시 한번 부탁해요 후원자님!(카연갤)/죽고 나서 진심이 되다/내가 15살은 아닐지라도/클레바테스/린코짱과 하루종일/정의의 학원/이세계 귀환 용사가 현대최강~/십자가의 6인/긍정적인 걸레 만화(완결, 리메이크 연재중)/내일, 나는 누군가의 여자친구/겟백(웹툰)/너를 사랑하는 살인귀/양아치 퇴마사 레이나/풀 나이트/아내, 초등학생이 되다/지금부터 윤리시간입니다/마법소녀 강림! 그리고 10년 후(카연갤)/더러운 네가 가장 귀여워/소년의 어비스/약사의 혼잣말/섬의 소리/해변의 큐/마술사들의 혼란/괴인영애/집이 없어(웹툰)/뚱뚱보 남친~/히로인은 절망했습니다/내가 나로 되기까지(TS)";
let strC = "비의 목(번역중단)/물 웅덩이에 뜬 섬(번역중단)/수꽃 ADABANA(번역중단)/외톨이 괴물과 맹인 소녀(번역중단)/남성공포증이던 내가 av배우~(번역중단)/행복색 원룸(정발낙태)/안녕 사이코패스(번역중단)/네가 내 마음에 자리잡았다(정발낙태)/조금 사회에 부적합 양(번역중단)/너에게 사랑받아 아팠다(장기휴재)/프로미스 신데렐라(정발낙태)/백합 지옥(번역중단)/이세계에서 힘내는 이야기(번역중단)/네거티브 용사와 마왕 군 간부(번역중단)/사후편지(x)/스피드 그래퍼(x)/라스트 멘헤라(미번역)/아버지가 빨리 죽길(미번역)/네가 그걸 사랑이라고 불러도(번역중단)/굿바이 미니스커트(정발, 이북 없음)/아사코(번역중단)/모조 크리스탈(작가명)/연옥의 카르마(번역중단)/착정병원(x)(완결)/그녀의 팔은 닿지 않는다(연중? 낙태?)/블라인드니스(x)/신이 된 날(x)/보쿠(완결)(번역본 소실)/공의경계-통각잔류(x)/아침이 온다(x)/명을 내리소서(x)/사일런트 위치(x)(미번역)/우츠보라(종이책)/나락의 두 사람(완결)(미번역)/슈가 다크(완결)(번역본 소실)/허5파6(작가명)/하늘이 잿빛이라서(완결)(번역본 소실)/사신에게 시집가는 날(미번역)/미추의 대지(완결)(미번역)/괴이와 소녀와 행방불명(연중?)/새장의 한 쌍(완결)(미번역)/내 남편은 냉동고에 잠들어있다(미번역)/울 때까지 쳐맞은~(완결)(미번역)/감추면(완결)(미번역)/나의 행복한 결혼(미번역)/나락의 양(완결)(미번역)/변옥의 슈베스터(완결)(미번역)/뼛속까지 나에게 바쳐(미번역)/소녀지배(완결)(미번역)/쿠로오니(미번역)/요코야리 멘고(쓰레기의 본망 작가)(단편)/나의 오리온(완결)(번역본 소실)/모조 크리스탈(작가명)(네이버 블로그에 작품목록 존재)/노노노노(완결)(번역본 소실)/중졸 노동자(완결)(미번역)/트랜스지터~(완결)(미번역)(TS)/앗치 아이(작가명)(오게하 작가)/니지, 어리광 부려 줘(미번역)/avogado6(단편 만화가)/nekozukin9(단편 만화가)/콤플렉스 에이지(번역본 소실)/쩜타지(연재 중단)";
let strD = "나침반 콤플렉스(단편)(카연갤)/언니가 되어줘(완결)/마족애미(완결)/은하의 죽지않는 아이들에게(완결)/상처투성이의 피아노 소나타(완결)/마녀의 집(완결)/언제나 꿈을(완결)/전여친의 딸(완결)/미치광이 맥(연재 중단)/별과 하나의 시(완결)/귀향(단편)/흡혈귀 마르그리트와~(단편)/우리들, 지옥의 도피행(단편)/물에 빠진 불꽃(완결)/미즈노와 차야마(완결)/사지짱의 아픔 일기(완결)/클로젯 걸(단편)/기타맨(완결)/마녀가 내리는 철퇴(완결)/지옥프리(완결)/deep water 심연(완결)/매일 세상을 구하기! 세이류 사쿠라 짱!(완결)/쓰르라미 울 적에《3부 타타리고로시》(완결)/아가씨와 우렁총각(완결)/시바토라(완결)/상처투성이 악마(완결)/사탕과자 탄환은 꿰뚫지 못해(완결)/이 사랑은, 이단(완결)/남자들만 있는 기사단에 입단한~(완결)(카연갤)/검은선(완결)(네이버웹툰)/딸의 친구(완결)/주인공이 미소녀니까 씹덕물이 맞겠지(완결)(카연갤)/숨비소리(완결)/가엾어라 겐키 군(완결)/mars(완결)/방패용사(2~4화만)/여자친구(완결)/남은목숨x99(완결)/빌리어네어 걸(완결)/종종 종교권유를 위해~(완결)/엄마에게 버려져 남겨진 아이의 이야기(완결)/생자의 행진(완결)/와해된 시선(완결)/아빠를 찾습니다(완결)/베리언트(완결)/귀녀연애금지령(출하)/우츠보라(종이책)/푸른하늘과 흐린하늘(완결)/사랑하는 기생충(완결)/사축과 소녀의 1800일(완결)/메멘토 숲(완결)/쿠로(완결)/하얀피난(완결)/뼈가 썩을 때까지(완결)/PTSD(완결)/플라이 대디 플라이(완결)/키드 아이 럭(완결)/오나니 마스터 쿠로사와(완결)/금붕어(완결)/좀비소녀(완결)/견우와 직녀(완결)/히메노스피어(완결)/금붕어(완결)/이것은 사랑의 이야기(완결)/그녀가 된 날(완결)(TS)/시스터 미닛(연중)(TS)/산카레아(완결)/저기압 신데렐라(완결)(TS)/스트레칭(완결)/수신의 제물(완결)/나의 소년(완결)/살육의 천사(완결)/별의 퐁코와 두부가게 레이코(완결)/우타이테의 발라드(완결)/세실리아 도어즈(완결)/그래도 나는 널 좋아해(완결)/3D 그녀(완결)/이 세상의 한구석에(완결)/사형수 042(완결)/안녕, 가시나무 공주(완결)/일주일간 프렌드(완결)/불완전한 사람을 위해서(완결)/브로큰 플라워(x)(완결)/창가의 타바코 양(x)(완결)/꼭두각시 오데트(완결)/마음이 외치고 싶어해(완결)/쿠니하치부(완결)/사잔카sazanka(단편)/망고의 뼈(완결)/네가 세상을 부수고 싶다면(완결)/봄의 저주(완결)/드롭(완결)/하얀데레(완결)/ho!(완결)/시크릿 동맹(완결)/소돔 꽃에 반짝이는 별(단편)/또다시 같은 꿈을 꾸었어(완결)/우주를 누비는 쏙독새(완결)(TS)/키스 앤 네버 크라이(완결)/엘펜리트(완결)/죽고 싶은 무사와 히비키(완결)/에덴의 꽃(완결)/밸런스 폴리시(완결)/애완소녀(완결)/토끼가 두 마리(완결)/절대쾌락소녀(완결)/그대는 나의 음란한 여왕님(완결)/히나마츠리(완결)/소녀가 죽는 이야기(완결)/나는 마리 안에(완결)(TS)/부적은 커터(단편)/마이 브로큰 마리코(완결)/사춘기 비터 체인지(완결)(TS)/렌탈 오빠(완결)/세계귀(완결)/바이 스프링(완결)/소녀사전(연중)/내가 나로 되기까지(TS)/소녀불충분(완결)(소설원작)/아이들의 노래(완결)/히메고토 - 19살의 제복(완결)/목소리의 형태(완결)/물에 빠진 나이프(완결)/사쿠란보 신드롬(체리신드롬)(완결)/라이프(완결)/오렌지 리스트밴드(x)(완결)/들판과 잡초(완결)/비터 버진(완결)/거짓말쟁이 미군과 고장난 마짱(x)(완결)/사랑과 저주(완결)/레즈 풍속~(완결)/잘 자, 푼푼(완결)/교정 뒷편에는 천사가 묻혀 있다(완결)/해피 슈가 라이프(완결)/별하늘의 너(완결)/시스터 미닛(연중)(TS)/여자를 때리고 싶다!!(연중)";
let arr;
function setup(n) {
    var temp;
    if(n == 2) {
        temp = strA;
    }
    else if (n == 3) {
        temp = strB;
    }
    else if (n == 4) {
        temp = strC;
    }
    else if (n == 5) {
        temp = strD;
    }
    else if (n == 1) {
        temp = strA + "/" + strB + "/" + strC + "/" + strD;
    }
    arr = temp.split("/");
}

function maketable() {
    var tbody = document.getElementById("table");
    tbody.innerHTML = "";
    for (i = 0; i < arr.length; i++) {
        var temp = "<tr><td>" + i + "</td>" + "<td>" + arr[i] + "</td></tr>";
        tbody.innerHTML += temp;
    }
}

